

/*ВАРИАНТ 20 Три кристалла
Чтобы открыть портал, необходимо зажечь три древних кристалла.
Кристалл загорается, если переданная ему энергия(A, B, C) кратна трем.
Портал откроется только если загорятся все три кристалла.
Запишите условие открытия портала.*/


#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <windows.h>

int main()
{
    SetConsoleOutputCP(CP_UTF8);
    SetConsoleCP(CP_UTF8);

    int A, B, C;
    printf("Введите энергию трех кристаллов A, B и C: \n");
    scanf("%d %d %d", &A, &B, &C);
    if (A % 3 == 0 && B % 3 == 0 && C % 3 == 0)
    {
        printf("Все три кристалла загорелись! Портал открыт!\n");
    }
    else
    {
        printf("Не все кристаллы загорелись. Портал закрыт.\n");
    }

    return 0;
}
